cases/chpt4-ellip-effects/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    sym
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          1440;
        startFace       252720;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          3600;
        startFace       254160;
    }
    btm
    {
        type            wall;
        inGroups        1(wall);
        nFaces          3600;
        startFace       257760;
    }
    side1Andside2Andside3
    {
        type            wall;
        inGroups        1(wall);
        nFaces          4320;
        startFace       261360;
    }
)

// ************************************************************************* //
